ahmadawais.shades-of-purple@7.3.6
anthropic.claude-code@2.1.165
asvetliakov.vscode-neovim@1.19.0
bierner.markdown-preview-github-styles@2.2.0
bmewburn.vscode-intelephense-client@1.18.4
bradlc.vscode-tailwindcss@0.14.29
christian-kohler.npm-intellisense@1.4.5
christian-kohler.path-intellisense@2.10.0
dbaeumer.vscode-eslint@3.0.24
devsense.composer-php-vscode@1.70.18915
devsense.intelli-php-vscode@0.12.17700
devsense.phptools-vscode@1.70.18915
devsense.profiler-php-vscode@1.70.18915
dsznajder.es7-react-js-snippets@4.4.3
enkia.tokyo-night@1.1.2
esbenp.prettier-vscode@12.4.0
expo.vscode-expo-tools@1.6.3
formulahendry.auto-rename-tag@0.1.10
github.codespaces@1.18.13
github.copilot@1.388.0
github.copilot-chat@0.33.5
jdinhlife.gruvbox@1.29.1
ms-python.debugpy@2026.6.0
ms-python.python@2026.4.0
ms-python.vscode-pylance@2025.10.4
ms-python.vscode-python-envs@1.20.1
ms-vscode-remote.remote-containers@0.459.0
ms-vscode.cmake-tools@1.23.52
ms-vscode.cpp-devtools@0.5.13
ms-vscode.cpptools@1.32.2
ms-vscode.cpptools-extension-pack@1.5.1
ms-vscode.cpptools-themes@2.0.0
pkief.material-icon-theme@5.35.0
pmneo.tsimporter@2.0.1
postman.postman-for-vscode@1.19.1
prisma.prisma@31.11.0
pucelle.vscode-css-navigation@2.13.1
redhat.java@1.54.0
redhat.vscode-yaml@1.23.0
ritwickdey.liveserver@5.7.10
steoates.autoimport@1.5.4
streetsidesoftware.code-spell-checker@4.5.6
stylelint.vscode-stylelint@2.2.1
teabyii.ayu@1.1.12
vincaslt.highlight-matching-tag@0.11.0
vscjava.vscode-gradle@3.17.3
vscjava.vscode-java-debug@0.59.0
vscjava.vscode-java-dependency@0.27.5
vscjava.vscode-java-pack@0.31.0
vscjava.vscode-java-test@0.45.0
vscjava.vscode-maven@0.45.3
vscodevim.vim@1.32.4
